{
    "word2idx": {
        "<pad>": 0,
        "<unk>": 1,
        "VIN - inductor - VOUT": 2,
        "VIN - inductor - inductor - VOUT": 3,
        "VIN - capacitor - inductor - VOUT": 4,
        "VIN - inductor - inductor - GND": 5,
        "VIN - inductor - GND": 6,
        "VIN - capacitor - GND": 7,
        "VOUT - inductor - inductor - GND": 8,
        "VOUT - inductor - capacitor - GND": 9,
        "VOUT - inductor - GND": 10,
        "VIN - FET-A - FET-B - VOUT": 11,
        "VIN - FET-A - GND": 12,
        "VOUT - FET-B - GND": 13,
        "VIN - FET-A - inductor - VOUT": 14,
        "VIN - FET-A - VOUT": 15,
        "VIN - FET-A - inductor - GND": 16,
        "VOUT - inductor - FET-A - GND": 17,
        "VOUT - FET-A - FET-A - GND": 18,
        "VIN - inductor - capacitor - VOUT": 19,
        "VIN - capacitor - capacitor - VOUT": 20,
        "VIN - inductor - FET-A - GND": 21,
        "VIN - capacitor - FET-A - GND": 22,
        "VOUT - capacitor - FET-A - GND": 23,
        "VIN - FET-A - capacitor - VOUT": 24,
        "VIN - FET-B - GND": 25,
        "VOUT - capacitor - FET-A - inductor - GND": 26,
        "VOUT - capacitor - FET-A - FET-B - GND": 27,
        "VIN - capacitor - VOUT": 28,
        "VOUT - inductor - FET-B - GND": 29,
        "VOUT - FET-A - FET-B - GND": 30,
        "VOUT - capacitor - FET-B - GND": 31,
        "VIN - inductor - inductor - inductor - GND": 32,
        "VIN - capacitor - inductor - inductor - GND": 33,
        "VIN - FET-B - VOUT": 34,
        "VIN - FET-B - inductor - GND": 35,
        "VIN - FET-B - capacitor - FET-A - GND": 36,
        "VIN - capacitor - FET-B - GND": 37,
        "VIN - capacitor - capacitor - GND": 38,
        "VIN - FET-B - FET-B - GND": 39,
        "VIN - FET-B - capacitor - GND": 40,
        "VOUT - capacitor - GND": 41,
        "VIN - FET-B - FET-A - VOUT": 42,
        "VIN - FET-B - FET-A - FET-A - GND": 43,
        "VIN - FET-A - FET-A - GND": 44,
        "VOUT - FET-A - GND": 45,
        "VOUT - FET-B - FET-B - inductor - GND": 46,
        "VOUT - FET-B - FET-B - GND": 47,
        "VIN - inductor - capacitor - GND": 48,
        "VOUT - FET-A - FET-B - FET-B - GND": 49,
        "VOUT - FET-B - capacitor - GND": 50,
        "VIN - inductor - FET-A - VOUT": 51,
        "VIN - FET-A - FET-A - VOUT": 52,
        "VOUT - capacitor - inductor - GND": 53,
        "VOUT - capacitor - capacitor - FET-A - GND": 54,
        "VIN - inductor - capacitor - capacitor - VOUT": 55,
        "VIN - inductor - inductor - capacitor - GND": 56,
        "VIN - FET-A - FET-B - GND": 57,
        "VIN - FET-B - FET-B - VOUT": 58,
        "VIN - FET-A - capacitor - FET-B - GND": 59,
        "VIN - capacitor - FET-A - VOUT": 60,
        "VIN - inductor - FET-B - GND": 61,
        "VOUT - capacitor - inductor - FET-B - GND": 62,
        "VOUT - FET-A - inductor - GND": 63,
        "VOUT - FET-A - capacitor - GND": 64,
        "VIN - inductor - FET-B - VOUT": 65,
        "VIN - FET-B - FET-A - GND": 66,
        "VOUT - FET-A - FET-B - FET-A - GND": 67,
        "VOUT - FET-B - FET-A - GND": 68,
        "VOUT - FET-B - inductor - GND": 69,
        "VIN - FET-B - capacitor - VOUT": 70,
        "VIN - FET-A - capacitor - GND": 71,
        "VIN - FET-A - FET-B - FET-B - GND": 72,
        "VIN - FET-B - inductor - FET-B - VOUT": 73,
        "VIN - inductor - inductor - FET-B - VOUT": 74,
        "VOUT - capacitor - FET-B - inductor - GND": 75,
        "VOUT - capacitor - capacitor - inductor - GND": 76,
        "VIN - capacitor - capacitor - FET-A - VOUT": 77,
        "VOUT - FET-A - capacitor - capacitor - GND": 78,
        "VOUT - inductor - inductor - capacitor - GND": 79,
        "VIN - FET-A - inductor - inductor - VOUT": 80,
        "VIN - capacitor - inductor - inductor - VOUT": 81,
        "VIN - capacitor - inductor - GND": 82,
        "VIN - FET-B - inductor - VOUT": 83,
        "VIN - FET-B - inductor - FET-A - GND": 84,
        "VOUT - inductor - inductor - FET-A - GND": 85,
        "VOUT - inductor - FET-A - FET-A - GND": 86,
        "VIN - inductor - FET-A - FET-B - GND": 87,
        "VOUT - FET-A - inductor - inductor - GND": 88,
        "VOUT - capacitor - capacitor - GND": 89,
        "VIN - FET-B - FET-A - capacitor - VOUT": 90,
        "VIN - capacitor - FET-A - capacitor - VOUT": 91,
        "VIN - FET-A - FET-B - capacitor - GND": 92,
        "VIN - FET-A - capacitor - capacitor - GND": 93,
        "VOUT - inductor - FET-A - inductor - GND": 94,
        "VIN - FET-B - inductor - capacitor - VOUT": 95,
        "VIN - inductor - FET-A - FET-A - GND": 96,
        "VIN - FET-B - FET-B - FET-A - GND": 97,
        "VOUT - FET-A - FET-B - capacitor - GND": 98,
        "VIN - FET-B - inductor - inductor - GND": 99,
        "VIN - FET-B - inductor - FET-A - VOUT": 100,
        "VIN - capacitor - FET-B - VOUT": 101,
        "VOUT - FET-B - FET-B - FET-A - GND": 102,
        "VIN - FET-A - FET-A - FET-A - GND": 103,
        "VIN - FET-B - FET-A - FET-B - GND": 104,
        "VIN - capacitor - FET-A - FET-B - GND": 105,
        "VIN - FET-A - FET-A - inductor - GND": 106,
        "VIN - capacitor - capacitor - FET-B - GND": 107,
        "VIN - inductor - FET-A - FET-B - VOUT": 108,
        "VIN - capacitor - FET-B - FET-A - GND": 109,
        "VIN - FET-B - FET-B - FET-A - capacitor - GND": 110,
        "VOUT - FET-B - FET-A - capacitor - GND": 111,
        "VIN - FET-A - FET-B - FET-A - GND": 112,
        "VIN - FET-A - capacitor - inductor - GND": 113,
        "VIN - FET-A - FET-B - capacitor - VOUT": 114,
        "VOUT - FET-B - inductor - FET-A - inductor - GND": 115,
        "VOUT - FET-A - capacitor - FET-A - GND": 116,
        "VIN - FET-A - FET-A - capacitor - FET-B - VOUT": 117,
        "VIN - FET-A - FET-B - inductor - GND": 118,
        "VIN - capacitor - FET-B - inductor - GND": 119,
        "VOUT - inductor - FET-B - inductor - GND": 120,
        "VOUT - inductor - capacitor - inductor - GND": 121,
        "VIN - FET-B - inductor - inductor - VOUT": 122,
        "VIN - FET-B - capacitor - inductor - VOUT": 123,
        "VIN - FET-B - FET-B - inductor - VOUT": 124,
        "VIN - FET-B - FET-A - capacitor - GND": 125,
        "VOUT - FET-B - inductor - capacitor - GND": 126,
        "VIN - FET-A - inductor - FET-B - GND": 127,
        "VIN - FET-A - inductor - capacitor - GND": 128,
        "VIN - FET-B - FET-B - capacitor - VOUT": 129,
        "VIN - capacitor - inductor - FET-B - GND": 130,
        "VOUT - FET-B - FET-B - capacitor - GND": 131,
        "VIN - inductor - capacitor - inductor - VOUT": 132,
        "VIN - FET-A - capacitor - inductor - VOUT": 133,
        "VOUT - FET-A - capacitor - inductor - GND": 134,
        "VIN - inductor - FET-B - FET-A - FET-B - GND": 135,
        "VOUT - FET-B - FET-A - FET-B - GND": 136,
        "VIN - capacitor - FET-B - capacitor - VOUT": 137,
        "VOUT - inductor - capacitor - FET-B - GND": 138,
        "VIN - inductor - FET-A - capacitor - GND": 139,
        "VOUT - FET-B - FET-B - FET-B - GND": 140,
        "VIN - FET-A - capacitor - capacitor - VOUT": 141,
        "VOUT - FET-B - capacitor - capacitor - GND": 142,
        "VOUT - capacitor - inductor - capacitor - GND": 143,
        "VIN - FET-A - inductor - FET-A - GND": 144,
        "VOUT - FET-B - inductor - FET-B - capacitor - GND": 145,
        "VOUT - FET-A - FET-A - FET-A - FET-A - GND": 146,
        "VIN - FET-B - FET-B - FET-B - VOUT": 147,
        "VOUT - capacitor - FET-B - FET-B - GND": 148,
        "VOUT - capacitor - capacitor - FET-B - GND": 149,
        "VIN - FET-B - inductor - capacitor - GND": 150,
        "VIN - FET-B - capacitor - capacitor - GND": 151,
        "VOUT - FET-A - capacitor - FET-B - GND": 152,
        "VOUT - capacitor - FET-A - FET-A - GND": 153,
        "VOUT - FET-B - FET-A - inductor - GND": 154,
        "VIN - FET-A - inductor - capacitor - VOUT": 155,
        "VIN - capacitor - inductor - capacitor - GND": 156,
        "VIN - capacitor - FET-A - FET-A - VOUT": 157,
        "VOUT - FET-B - capacitor - inductor - GND": 158,
        "VIN - FET-A - FET-A - capacitor - GND": 159,
        "VOUT - FET-B - capacitor - FET-B - GND": 160,
        "VOUT - capacitor - FET-A - capacitor - inductor - GND": 161,
        "VIN - capacitor - capacitor - inductor - VOUT": 162,
        "VOUT - inductor - capacitor - capacitor - GND": 163,
        "VIN - inductor - capacitor - FET-B - VOUT": 164,
        "VOUT - FET-A - FET-B - inductor - GND": 165,
        "VIN - FET-B - capacitor - FET-A - VOUT": 166,
        "VOUT - FET-A - inductor - FET-B - GND": 167,
        "VIN - inductor - inductor - inductor - VOUT": 168,
        "VIN - FET-A - capacitor - FET-A - VOUT": 169,
        "VOUT - inductor - inductor - inductor - GND": 170,
        "VIN - FET-B - capacitor - FET-B - VOUT": 171,
        "VIN - inductor - FET-B - FET-A - VOUT": 172,
        "VIN - inductor - FET-B - capacitor - VOUT": 173,
        "VOUT - FET-A - FET-A - capacitor - GND": 174,
        "VIN - FET-B - inductor - FET-B - GND": 175,
        "VIN - inductor - capacitor - FET-A - GND": 176,
        "VIN - inductor - FET-A - inductor - VOUT": 177,
        "VIN - inductor - FET-A - FET-A - VOUT": 178,
        "VIN - inductor - capacitor - FET-A - VOUT": 179,
        "VIN - FET-B - FET-B - capacitor - GND": 180,
        "VIN - inductor - capacitor - inductor - GND": 181,
        "VIN - capacitor - capacitor - capacitor - GND": 182,
        "VOUT - inductor - capacitor - capacitor - capacitor - GND": 183,
        "VIN - FET-A - FET-A - capacitor - VOUT": 184,
        "VOUT - inductor - FET-B - capacitor - GND": 185,
        "VOUT - FET-B - inductor - inductor - GND": 186,
        "VIN - FET-B - FET-A - inductor - GND": 187,
        "VIN - FET-A - inductor - FET-A - VOUT": 188,
        "VOUT - capacitor - inductor - inductor - GND": 189
    },
    "idx2word": {
        "0": "<pad>",
        "1": "<unk>",
        "2": "VIN - inductor - VOUT",
        "3": "VIN - inductor - inductor - VOUT",
        "4": "VIN - capacitor - inductor - VOUT",
        "5": "VIN - inductor - inductor - GND",
        "6": "VIN - inductor - GND",
        "7": "VIN - capacitor - GND",
        "8": "VOUT - inductor - inductor - GND",
        "9": "VOUT - inductor - capacitor - GND",
        "10": "VOUT - inductor - GND",
        "11": "VIN - FET-A - FET-B - VOUT",
        "12": "VIN - FET-A - GND",
        "13": "VOUT - FET-B - GND",
        "14": "VIN - FET-A - inductor - VOUT",
        "15": "VIN - FET-A - VOUT",
        "16": "VIN - FET-A - inductor - GND",
        "17": "VOUT - inductor - FET-A - GND",
        "18": "VOUT - FET-A - FET-A - GND",
        "19": "VIN - inductor - capacitor - VOUT",
        "20": "VIN - capacitor - capacitor - VOUT",
        "21": "VIN - inductor - FET-A - GND",
        "22": "VIN - capacitor - FET-A - GND",
        "23": "VOUT - capacitor - FET-A - GND",
        "24": "VIN - FET-A - capacitor - VOUT",
        "25": "VIN - FET-B - GND",
        "26": "VOUT - capacitor - FET-A - inductor - GND",
        "27": "VOUT - capacitor - FET-A - FET-B - GND",
        "28": "VIN - capacitor - VOUT",
        "29": "VOUT - inductor - FET-B - GND",
        "30": "VOUT - FET-A - FET-B - GND",
        "31": "VOUT - capacitor - FET-B - GND",
        "32": "VIN - inductor - inductor - inductor - GND",
        "33": "VIN - capacitor - inductor - inductor - GND",
        "34": "VIN - FET-B - VOUT",
        "35": "VIN - FET-B - inductor - GND",
        "36": "VIN - FET-B - capacitor - FET-A - GND",
        "37": "VIN - capacitor - FET-B - GND",
        "38": "VIN - capacitor - capacitor - GND",
        "39": "VIN - FET-B - FET-B - GND",
        "40": "VIN - FET-B - capacitor - GND",
        "41": "VOUT - capacitor - GND",
        "42": "VIN - FET-B - FET-A - VOUT",
        "43": "VIN - FET-B - FET-A - FET-A - GND",
        "44": "VIN - FET-A - FET-A - GND",
        "45": "VOUT - FET-A - GND",
        "46": "VOUT - FET-B - FET-B - inductor - GND",
        "47": "VOUT - FET-B - FET-B - GND",
        "48": "VIN - inductor - capacitor - GND",
        "49": "VOUT - FET-A - FET-B - FET-B - GND",
        "50": "VOUT - FET-B - capacitor - GND",
        "51": "VIN - inductor - FET-A - VOUT",
        "52": "VIN - FET-A - FET-A - VOUT",
        "53": "VOUT - capacitor - inductor - GND",
        "54": "VOUT - capacitor - capacitor - FET-A - GND",
        "55": "VIN - inductor - capacitor - capacitor - VOUT",
        "56": "VIN - inductor - inductor - capacitor - GND",
        "57": "VIN - FET-A - FET-B - GND",
        "58": "VIN - FET-B - FET-B - VOUT",
        "59": "VIN - FET-A - capacitor - FET-B - GND",
        "60": "VIN - capacitor - FET-A - VOUT",
        "61": "VIN - inductor - FET-B - GND",
        "62": "VOUT - capacitor - inductor - FET-B - GND",
        "63": "VOUT - FET-A - inductor - GND",
        "64": "VOUT - FET-A - capacitor - GND",
        "65": "VIN - inductor - FET-B - VOUT",
        "66": "VIN - FET-B - FET-A - GND",
        "67": "VOUT - FET-A - FET-B - FET-A - GND",
        "68": "VOUT - FET-B - FET-A - GND",
        "69": "VOUT - FET-B - inductor - GND",
        "70": "VIN - FET-B - capacitor - VOUT",
        "71": "VIN - FET-A - capacitor - GND",
        "72": "VIN - FET-A - FET-B - FET-B - GND",
        "73": "VIN - FET-B - inductor - FET-B - VOUT",
        "74": "VIN - inductor - inductor - FET-B - VOUT",
        "75": "VOUT - capacitor - FET-B - inductor - GND",
        "76": "VOUT - capacitor - capacitor - inductor - GND",
        "77": "VIN - capacitor - capacitor - FET-A - VOUT",
        "78": "VOUT - FET-A - capacitor - capacitor - GND",
        "79": "VOUT - inductor - inductor - capacitor - GND",
        "80": "VIN - FET-A - inductor - inductor - VOUT",
        "81": "VIN - capacitor - inductor - inductor - VOUT",
        "82": "VIN - capacitor - inductor - GND",
        "83": "VIN - FET-B - inductor - VOUT",
        "84": "VIN - FET-B - inductor - FET-A - GND",
        "85": "VOUT - inductor - inductor - FET-A - GND",
        "86": "VOUT - inductor - FET-A - FET-A - GND",
        "87": "VIN - inductor - FET-A - FET-B - GND",
        "88": "VOUT - FET-A - inductor - inductor - GND",
        "89": "VOUT - capacitor - capacitor - GND",
        "90": "VIN - FET-B - FET-A - capacitor - VOUT",
        "91": "VIN - capacitor - FET-A - capacitor - VOUT",
        "92": "VIN - FET-A - FET-B - capacitor - GND",
        "93": "VIN - FET-A - capacitor - capacitor - GND",
        "94": "VOUT - inductor - FET-A - inductor - GND",
        "95": "VIN - FET-B - inductor - capacitor - VOUT",
        "96": "VIN - inductor - FET-A - FET-A - GND",
        "97": "VIN - FET-B - FET-B - FET-A - GND",
        "98": "VOUT - FET-A - FET-B - capacitor - GND",
        "99": "VIN - FET-B - inductor - inductor - GND",
        "100": "VIN - FET-B - inductor - FET-A - VOUT",
        "101": "VIN - capacitor - FET-B - VOUT",
        "102": "VOUT - FET-B - FET-B - FET-A - GND",
        "103": "VIN - FET-A - FET-A - FET-A - GND",
        "104": "VIN - FET-B - FET-A - FET-B - GND",
        "105": "VIN - capacitor - FET-A - FET-B - GND",
        "106": "VIN - FET-A - FET-A - inductor - GND",
        "107": "VIN - capacitor - capacitor - FET-B - GND",
        "108": "VIN - inductor - FET-A - FET-B - VOUT",
        "109": "VIN - capacitor - FET-B - FET-A - GND",
        "110": "VIN - FET-B - FET-B - FET-A - capacitor - GND",
        "111": "VOUT - FET-B - FET-A - capacitor - GND",
        "112": "VIN - FET-A - FET-B - FET-A - GND",
        "113": "VIN - FET-A - capacitor - inductor - GND",
        "114": "VIN - FET-A - FET-B - capacitor - VOUT",
        "115": "VOUT - FET-B - inductor - FET-A - inductor - GND",
        "116": "VOUT - FET-A - capacitor - FET-A - GND",
        "117": "VIN - FET-A - FET-A - capacitor - FET-B - VOUT",
        "118": "VIN - FET-A - FET-B - inductor - GND",
        "119": "VIN - capacitor - FET-B - inductor - GND",
        "120": "VOUT - inductor - FET-B - inductor - GND",
        "121": "VOUT - inductor - capacitor - inductor - GND",
        "122": "VIN - FET-B - inductor - inductor - VOUT",
        "123": "VIN - FET-B - capacitor - inductor - VOUT",
        "124": "VIN - FET-B - FET-B - inductor - VOUT",
        "125": "VIN - FET-B - FET-A - capacitor - GND",
        "126": "VOUT - FET-B - inductor - capacitor - GND",
        "127": "VIN - FET-A - inductor - FET-B - GND",
        "128": "VIN - FET-A - inductor - capacitor - GND",
        "129": "VIN - FET-B - FET-B - capacitor - VOUT",
        "130": "VIN - capacitor - inductor - FET-B - GND",
        "131": "VOUT - FET-B - FET-B - capacitor - GND",
        "132": "VIN - inductor - capacitor - inductor - VOUT",
        "133": "VIN - FET-A - capacitor - inductor - VOUT",
        "134": "VOUT - FET-A - capacitor - inductor - GND",
        "135": "VIN - inductor - FET-B - FET-A - FET-B - GND",
        "136": "VOUT - FET-B - FET-A - FET-B - GND",
        "137": "VIN - capacitor - FET-B - capacitor - VOUT",
        "138": "VOUT - inductor - capacitor - FET-B - GND",
        "139": "VIN - inductor - FET-A - capacitor - GND",
        "140": "VOUT - FET-B - FET-B - FET-B - GND",
        "141": "VIN - FET-A - capacitor - capacitor - VOUT",
        "142": "VOUT - FET-B - capacitor - capacitor - GND",
        "143": "VOUT - capacitor - inductor - capacitor - GND",
        "144": "VIN - FET-A - inductor - FET-A - GND",
        "145": "VOUT - FET-B - inductor - FET-B - capacitor - GND",
        "146": "VOUT - FET-A - FET-A - FET-A - FET-A - GND",
        "147": "VIN - FET-B - FET-B - FET-B - VOUT",
        "148": "VOUT - capacitor - FET-B - FET-B - GND",
        "149": "VOUT - capacitor - capacitor - FET-B - GND",
        "150": "VIN - FET-B - inductor - capacitor - GND",
        "151": "VIN - FET-B - capacitor - capacitor - GND",
        "152": "VOUT - FET-A - capacitor - FET-B - GND",
        "153": "VOUT - capacitor - FET-A - FET-A - GND",
        "154": "VOUT - FET-B - FET-A - inductor - GND",
        "155": "VIN - FET-A - inductor - capacitor - VOUT",
        "156": "VIN - capacitor - inductor - capacitor - GND",
        "157": "VIN - capacitor - FET-A - FET-A - VOUT",
        "158": "VOUT - FET-B - capacitor - inductor - GND",
        "159": "VIN - FET-A - FET-A - capacitor - GND",
        "160": "VOUT - FET-B - capacitor - FET-B - GND",
        "161": "VOUT - capacitor - FET-A - capacitor - inductor - GND",
        "162": "VIN - capacitor - capacitor - inductor - VOUT",
        "163": "VOUT - inductor - capacitor - capacitor - GND",
        "164": "VIN - inductor - capacitor - FET-B - VOUT",
        "165": "VOUT - FET-A - FET-B - inductor - GND",
        "166": "VIN - FET-B - capacitor - FET-A - VOUT",
        "167": "VOUT - FET-A - inductor - FET-B - GND",
        "168": "VIN - inductor - inductor - inductor - VOUT",
        "169": "VIN - FET-A - capacitor - FET-A - VOUT",
        "170": "VOUT - inductor - inductor - inductor - GND",
        "171": "VIN - FET-B - capacitor - FET-B - VOUT",
        "172": "VIN - inductor - FET-B - FET-A - VOUT",
        "173": "VIN - inductor - FET-B - capacitor - VOUT",
        "174": "VOUT - FET-A - FET-A - capacitor - GND",
        "175": "VIN - FET-B - inductor - FET-B - GND",
        "176": "VIN - inductor - capacitor - FET-A - GND",
        "177": "VIN - inductor - FET-A - inductor - VOUT",
        "178": "VIN - inductor - FET-A - FET-A - VOUT",
        "179": "VIN - inductor - capacitor - FET-A - VOUT",
        "180": "VIN - FET-B - FET-B - capacitor - GND",
        "181": "VIN - inductor - capacitor - inductor - GND",
        "182": "VIN - capacitor - capacitor - capacitor - GND",
        "183": "VOUT - inductor - capacitor - capacitor - capacitor - GND",
        "184": "VIN - FET-A - FET-A - capacitor - VOUT",
        "185": "VOUT - inductor - FET-B - capacitor - GND",
        "186": "VOUT - FET-B - inductor - inductor - GND",
        "187": "VIN - FET-B - FET-A - inductor - GND",
        "188": "VIN - FET-A - inductor - FET-A - VOUT",
        "189": "VOUT - capacitor - inductor - inductor - GND"
    },
    "idx": 190
}